<template>
  <v-row>
    <v-col cols="4" class="mx-auto text-center">
      <Input :options="options" :min="5" :max="10" required type="text" :highlight="text" />
      <!-- <input type="text" v-model="search" /> -->
      <p>
        {{ options.text }}
      </p>

     
    </v-col>
  </v-row>
</template>

<script>
import Input from "../components/input/Input";
export default {
  components: {
    Input,
  },
  data() {
    return {
      options: {
        id: "i1",
        label: "اولین input",
        placeholder: "این یک تست است ",
      },
        text:"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد."
    };
  },
};
</script>
